Documents/ЗакрытиеДоговораЗайма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ЗакрытиеДоговораЗайма</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПараметрыДоговораЗайма</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.ПараметрыДоговораЗаймаАгент</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДоговорЗайма</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПроцента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПараметрыДоговораЗайма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыДоговораЗайма</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗакрытиеДоговораЗайма/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ);
	ПодготовитьТаблицыДляДвижений(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ);
	СформироватьДвиженияВРегистры(ДополнительныеСвойства, Движения, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ) Экспорт 
	
	ДополнительныеСвойства.Вставить("ВалютаРегУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	
КонецПроцедуры

Процедура ПодготовитьТаблицыДляДвижений(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ) Экспорт
	
	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", новый Структура());
	
	ПодготовитьТаблицыДляДвижений_ПараметрыДоговораЗайма(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ);	
	//ПодготовитьТаблицыДляДвижений_ПараметрыДоговораЗаймаАгент(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ);	
	
КонецПроцедуры

Процедура ПодготовитьТаблицыДляДвижений_ПараметрыДоговораЗайма(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ) Экспорт
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ПараметрыДоговораЗайма", Новый ТаблицаЗначений);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка); 
	Запрос.УстановитьПараметр("ДоговорЗайма", Ссылка.ДокументОснование);
	ЗАпрос.УстановитьПараметр("Организация", Ссылка.ДокументОснование.Организация);
	Запрос.УстановитьПараметр("Контрагент", Ссылка.ДокументОснование.Контрагент);
	Запрос.УстановитьПараметр("Период", Ссылка.ДатаЗакрытияДоговора);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	&Период КАК Период,
	               |	ПараметрыДоговора.Организация КАК Организация,
	               |	ПараметрыДоговора.Контрагент КАК Контрагент,
	               |	ПараметрыДоговора.ДоговорЗайма КАК ДоговорЗайма,
	               |	ПараметрыДоговора.ДатаНачала КАК ДатаНачала,
	               |	&Период КАК ДатаОкончания,
	               |	ПараметрыДоговора.Валюта КАК Валюта,
	               |	ПараметрыДоговора.СчетУчета КАК СчетУчета,
	               |	ПараметрыДоговора.СчетУчетаПроцентов КАК СчетУчетаПроцентов,
	               |	ПараметрыДоговора.Процент КАК Процент,
	               |	ДокументЗакрытия.Сумма КАК СуммаЗайма,
	               |	ДокументЗакрытия.СуммаПроцента КАК СуммаПроцентовНачислено,
	               |	ИСТИНА КАК Состояние
	               |ИЗ
	               |	Документ.ЗакрытиеДоговораЗайма КАК ДокументЗакрытия
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыДоговораЗайма.СрезПоследних(
	               |				&Период,
	               |				Организация = &Организация
	               |					И Контрагент = &Контрагент
	               |					И ДоговорЗайма = &ДоговорЗайма) КАК ПараметрыДоговора
	               |		ПО ДокументЗакрытия.ДокументОснование = ПараметрыДоговора.ДоговорЗайма
	               |ГДЕ
	               |	ДокументЗакрытия.Ссылка = &ДокументСсылка";
	//
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выгрузить();
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ПараметрыДоговораЗайма", Выборка);
	
КонецПроцедуры

Процедура СформироватьДвиженияВРегистры(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДвижений = ДополнительныеСвойства.ТаблицыДляДвижений.ПараметрыДоговораЗайма;
	Если ТаблицаДвижений.Количество() > 0 Тогда
		Движения.ПараметрыДоговораЗайма.Записывать = Истина;
		Движения.ПараметрыДоговораЗайма.Загрузить(ТаблицаДвижений);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
